project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "'FirstUser'"], ["email", "'email_2@gamil.com'"], ["created_at", "2018-05-07 22:15:39.143396"], ["updated_at", "2018-05-07 22:15:39.143396"]]
---
  def create
    user = User.new(params.require(:user).permit(:name, :email))
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "'what_is_this'"], ["email", "'this_is_sparta'"], ["updated_at", "2018-05-07 22:30:46.111076"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    user.update(params.require(:user).permit(:name, :email))